/**@file

 @copyright
  INTEL CONFIDENTIAL
  Copyright 2011 - 2018 Intel Corporation.

  The source code contained or described herein and all documents related to the
  source code ("Material") are owned by Intel Corporation or its suppliers or
  licensors. Title to the Material remains with Intel Corporation or its suppliers
  and licensors. The Material may contain trade secrets and proprietary and
  confidential information of Intel Corporation and its suppliers and licensors,
  and is protected by worldwide copyright and trade secret laws and treaty
  provisions. No part of the Material may be used, copied, reproduced, modified,
  published, uploaded, posted, transmitted, distributed, or disclosed in any way
  without Intel's prior express written permission.

  No license under any patent, copyright, trade secret or other intellectual
  property right is granted to or conferred upon you by disclosure or delivery
  of the Materials, either expressly, by implication, inducement, estoppel or
  otherwise. Any license under such intellectual property rights must be
  express and approved by Intel in writing.

  Unless otherwise agreed by Intel in writing, you may not remove or alter
  this notice or any other notice embedded in Materials by Intel or
  Intel's suppliers or licensors in any way.

  This file contains a 'Sample Driver' and is licensed as such under the terms
  of your license agreement with Intel or your vendor. This file may be modified
  by the user, subject to the additional terms of the license agreement.

@par Specification
**/

//----------------------------------------------------------------------------
//
// Name:  OverClockSetup.uni
//
// Description: Unicode strings for OverClocking are implemented
//
//----------------------------------------------------------------------------
/=#
#include "VFR.uni"

#langdef   x-AMI "AmiMappingLanguage"           // AMI Mapping Language


#string STR_EMPTY_STRING                                        #language en-US ""
#string STR_DEFAULT_STRING                                      #language en-US "Default"

#string STR_PERFORMANCE_MENU_CONFIGURATION                      #language en-US "OverClocking Performance Menu"
                                                                #language x-AMI "RCOC001"
#string STR_PERFORMANCE_MENU_CONFIGURATION_TITLE                #language en-US "OverClocking Performance Menu"
#string STR_PERFORMANCE_MENU_CONFIGURATION_SUBTITLE             #language en-US "OverClocking Performance Menu"                                                                
#string STR_PERFORMANCE_CONFIGURATION_HELP                      #language en-US "Performance Menu for Processor and Memory."

#string STR_OVERCLOCKING_MENU_CONFIGURATION                     #language en-US "OverClocking Feature"
                                                                #language x-AMI "RCOC002"
#string STR_OVERCLOCKING_CONFIGURATION_HELP                     #language en-US "Performance Menu for Processor and Memory."

#string STR_XTU_INTERFACE_ENABLE                                #language en-US "XTU Interface"
                                                                #language x-AMI "RCOC004"
#string STR_XTU_INTERFACE_ENABLE_HELP                           #language en-US "Enable/Disable XTU Interface. BIOS will only expose XTU interface when enabled."

#string STR_WDT_ENABLE                                          #language en-US "WDT Enable"
                                                                #language x-AMI "RCOC003"
#string STR_WDT_ENABLE_HELP                                     #language en-US "Enable/Disable WatchDog Timer. Note: This option is ignored on debug BIOS."

#string STR_PLL_TRIM_CONFIGURATION                              #language en-US "Voltage PLL Trim Controls"
                                                                #language x-AMI "RCOC01M"
#string STR_PLL_TRIM_CONFIGURATION_TITLE                        #language en-US "Voltage PLL Trim Controls"
#string STR_PLL_TRIM_CONFIGURATION_SUBTITLE                     #language en-US "Voltage PLL Trim Controls"
#string STR_PLL_TRIM_CONFIGURATION_HELP                         #language en-US "Voltage PLL Trim Controls Menu"
	
#string STR_PROCESSOR_CONFIGURATION                             #language en-US "Processor"
                                                                #language x-AMI "RCOC00A"
#string STR_PROCESSOR_CONFIGURATION_TITLE                       #language en-US "Processor"
#string STR_PROCESSOR_CONFIGURATION_SUBTITLE                    #language en-US "Processor"
#string STR_PROCESSOR_CONFIGURATION_HELP                        #language en-US "Processor Bus Ratio Override and Bus Speed Override."

#string STR_TVB_CONFIGURATION                                   #language en-US "Thermal Velocity Boost (TVB)"

#string STR_FLEXENABLE_PROMPT                                   #language en-US "Non-Turbo Flex Support"
#string STR_FLEXENABLE_PROMPT_HELP                              #language en-US "Enable/Disable Non-Turbo Flex Support."

#string STR_PROCESSORBUS_RATIO_OVERRIDE_VALUE                   #language en-US "  Flex Ratio Override"
#string STR_PROCESSORBUS_RATIO_OVERRIDE_VALUE_HELP              #language en-US "Processor Flex Ratio Override Parameters with range 0 to 31 and the Min and Max may vary between Processors."

#string STR_FLEX_VID_ENABLE_PROMPT                              #language en-US "CPU VID Support"
#string STR_FLEX_VID_ENABLE_PROMPT_HELP                         #language en-US "Enable/Disable Cpu Vid Support."

#string STR_PROCESSOR_FLEXVID_OVERRIDE_VALUE                    #language en-US "  Flex VID Override"
#string STR_PROCESSOR_FLEXVID_OVERRIDE_VALUE_HELP               #language en-US "VID Override Parameters. The value may vary from 8 to 48 which actual relates to volts 1.4000v  to 0.9000v. Each step equates to 0.0125v."

#string STR_PROCESSOR_BUSSPEED_PROMPT                           #language en-US "Bus Speed Support"
#string STR_PROCESSOR_BUSSPEED_PROMPT_HELP                      #language en-US "Enable/Disable CPU Speed Override Support."

#string STR_PROCESSORBUS_SPEED_OVERRIDE_VALUE                   #language en-US "  Bus Speed Override (%)"
#string STR_PROCESSORBUS_SPEED_OVERRIDE_VALUE_HELP              #language en-US "Processor Bus Speed Override Parameters. The value entered will be taken as Overclocking Percentage(%) of current Clock frequency. The value varies from 0% to 49%."

#string STR_OVERCLOCK_EXPFREQ_PROMPT                            #language en-US "Expected CPU Freq"
#string STR_OVERCLOCK_EXPFREQ_VAL                               #language en-US ""
#string STR_OVERCLOCK_EXPFREQ_HELP                              #language en-US "Expected Processor frequency calculated using Bus ratio and Bus speed."

#string STR_CORE_RING_TITLE                                      #language en-US "Core/Ring"
#string STR_CORE_MAX_OC_RATIO                                   #language en-US "  Max OC Ratio"
                                                                #language x-AMI "RCOC00E"
#string STR_CORE_MAX_OC_RATIO_HELP                              #language en-US "Sets the maximum OC Ratio for the CPU Core and Ring. Uses Mailbox MSR 0x150, cmd 0x10, 0x11. Range 8-255. 0 is AUTO."

#string STR_CORE_VOLTAGE_MODE                                   #language en-US "  Voltage Mode"
                                                                #language x-AMI "RCOC00F"
#string STR_CORE_VOLTAGE_MODE_HELP                              #language en-US "Selects between Adaptive and Override Voltage modes. In Override Mode the voltage selected will be applied over all operating frequencies. In Adaptive Mode the voltage is interpolated only in turbo mode. Uses Mailbox MSR 0x150, cmd 0x10, 0x11."

#string STR_CORE_VOLTAGE_OVERRIDE                               #language en-US "  Voltage Override"
                                                                #language x-AMI "RCOC00G"
#string STR_CORE_VOLTAGE_OVERRIDE_HELP                          #language en-US "Specifies the Override Voltage applied to the IA Core domain. This voltage is specified in millivolts. Uses Mailbox MSR 0x150, cmd 0x11. Range 0-2000 mV."

#string STR_CORE_VOLTAGE_OFFSET                                 #language en-US "  Voltage Offset"
                                                                #language x-AMI "RCOC00I"
#string STR_CORE_VOLTAGE_OFFSET_HELP                            #language en-US "Specifies the Offset Voltage applied to the IA Core domain. This voltage is specified in millivolts. Uses Mailbox MSR 0x150, cmd 0x11. Range -500 to 500 mV"

#string STR_CORE_PLL_VOLTAGE_OFFSET                             #language en-US "Core PLL Voltage Offset"
                                                                #language x-AMI "RCOC00K"
#string STR_GT_PLL_VOLTAGE_OFFSET                               #language en-US "GT PLL Voltage Offset"
                                                                #language x-AMI "RCOC01P"
#string STR_RING_PLL_VOLTAGE_OFFSET                             #language en-US "Ring PLL Voltage Offset"
                                                                #language x-AMI "RCOC01Q"
#string STR_SA_PLL_VOLTAGE_OFFSET                               #language en-US "System Agent PLL Voltage Offset"
                                                                #language x-AMI "RCOC01R"
#string STR_MC_PLL_VOLTAGE_OFFSET                               #language en-US "Memory Controller PLL Voltage Offset"
                                                                #language x-AMI "RCOC01S"
#string STR_PLL_VOLTAGE_OFFSET_HELP                             #language en-US "PLL Voltage Offset, Range 0-63. Units are in 17.5mV. Default is 0. This control can be used to increase the range of this domain frequency in extreme overclocking conditions."

#string STR_CORE_EXTRA_TURBO_VOLTAGE                            #language en-US "  Extra Turbo Voltage"
                                                                #language x-AMI "RCOC00H"
#string STR_CORE_EXTRA_TURBO_VOLTAGE_HELP                       #language en-US "Specifies the extra turbo voltage applied while IA Core is operating in turbo mode. Uses Mailbox MSR 0x150, cmd 0x10, 0x11. Range 0-2000 mV"

#string STR_CORE_AVX2_RATIO_OFFSET                              #language en-US "AVX2 Ratio Offset"
                                                                #language x-AMI "RCOC008"
#string STR_CORE_AVX2_RATIO_OFFSET_HELP                         #language en-US "AVX2 Ratio Offset. Specifies number of bins to decrease AVX ratio vs. Core Ratio. AVX is a more stressful workload, it is helpful to lower the AVX ratio to ensure maximum possible ratio for SSE workloads. Uses Mailbox MSR 0x150, cmd 0x1B. Range 0 - 31. 0 = No offset."

#string STR_CORE_AVX3_RATIO_OFFSET                              #language en-US "AVX3 Ratio Offset"
#string STR_CORE_AVX3_RATIO_OFFSET_HELP                         #language en-US "AVX3 Ratio Offset. Specifies number of bins to decrease AVX ratio vs. Core Ratio. AVX is a more stressful workload, it is helpful to lower the AVX ratio to ensure maximum possible ratio for SSE workloads. Uses Mailbox MSR 0x150, cmd 0x1B. Range 0 - 31. 0 = No offset."

#string STR_CORE_TJMAX_OFFSET                                   #language en-US "TjMax Offset"
                                                                #language x-AMI "RCOC02U"
#string STR_CORE_TJMAX_OFFSET_HELP                              #language en-US "TjMax Offset. Specified value here is clipped by pCode (125 - TjMax Offset) to support TjMax in the range of 62 to 115 deg Celsius. Uses Mailbox MSR 0x37, command 0x01. Range 10 - 63. 0 = No offset. Only valid on CFL-S 8+2."

#string STR_TVB_RATIO_CLIPPING_PROMPT                           #language en-US "TVB Ratio Clipping"
                                                                #language x-AMI "RCOC02Q"
#string STR_TVB_RATIO_CLIPPING_HELP                             #language en-US "This service controls Core frequency reduction caused by high package temperatures for processors that implement the Intel Thermal Velocity Boost (TVB) feature. It is required to be disabled for supporting overclocking at frequencies higher than the default max turbo frequency. Default is disabled. Uses Overclocking Mailbox command 0x18/0x19."

#string STR_TVB_VOLTAGE_OPTIMIZATION_PROMPT                     #language en-US "TVB Voltage Optimizations"
                                                                #language x-AMI "RCOC02R"
#string STR_TVB_VOLTAGE_OPTIMIZATION_HELP                       #language en-US "This service controls thermal based voltage optimizations for processors that implement the Intel Thermal Velocity Boost (TVB) feature. Default is enabled. Uses Overclocking Mailbox command 0x18/0x19."
#string STR_BCLK_ADAPTIVE_VOLTAGE_ENABLE                        #language en-US "BCLK Aware Adaptive Voltage"
                                                                #language x-AMI "RCOC009"
#string STR_BCLK_ADAPTIVE_VOLTAGE_ENABLE_HELP                   #language en-US "BCLK Aware Adaptive Voltage enable/disable. When enabled, pcode will be aware of the BCLK frequency when calculating the CPU V/F curves. This is ideal for BCLK OC to avoid high voltage overrides. Uses OC Mailbox command 0x15."

#string STR_VOLTAGE_ADAPTIVE                                    #language en-US "Adaptive"
#string STR_VOLTAGE_OVERRIDE                                    #language en-US "Override"

#string STR_POSITIVE_SIGN                                       #language en-US "+"
#string STR_NEGATIVE_SIGN                                       #language en-US "-"

#string STR_CORE_VOLTAGE_OFFSET_PREFIX                          #language en-US "  Offset Prefix"
                                                                #language x-AMI "RCOC00J"
#string STR_GTS_VOLTAGE_OFFSET_PREFIX                           #language en-US "  Offset Prefix"
                                                                #language x-AMI "RCOC00S"
#string STR_GTUS_VOLTAGE_OFFSET_PREFIX                          #language en-US "  Offset Prefix"
                                                                #language x-AMI "RCOC00Y"
#string STR_UNCORE_VOLTAGE_OFFSET_PREFIX                        #language en-US "  Offset Prefix"
                                                                #language x-AMI "RCOC010"
#string STR_VOLTAGE_OFFSET_PREFIX_HELP                          #language en-US "Sets the offset value as positive or negative."

#string STR_VCC_CONFIGURATION                                   #language en-US "Platform Voltage Overrides"
                                                                #language x-AMI "RCOC01T"
#string STR_VCC_CONFIGURATION_TITLE                             #language en-US "Platform Voltage Overrides"
#string STR_VCC_CONFIGURATION_SUBTITLE                          #language en-US "Platform Voltage Overrides"
#string STR_VCC_CONFIGURATION_HELP                              #language en-US "Platform Voltages related Overclocking Menu"

#string STR_VCC_CORE_OVERRIDE_ENABLE                            #language en-US "VccCore Override Enable"
                                                                #language x-AMI "RCOC01U"
#string STR_VCC_CORE_OVERRIDE_ENABLE_HELP                       #language en-US "Overrides the VccCore voltage using SMBUS/PMBUS interface of VRM. Use the next option for exact voltage configuration"
#string STR_VCC_CORE_OVERRIDE_VOLTS                             #language en-US "  VccCore"
                                                                #language x-AMI "RCOC01V"
#string STR_VCC_CORE_OVERRIDE_VOLTS_HELP                        #language en-US "Range of VccCore voltage - Up to 2550 mV. Default is 1300 mV"

#string STR_VCC_ST_OVERRIDE_ENABLE                              #language en-US "VccST Override Enable"
                                                                #language x-AMI "RCOC01W"
#string STR_VCC_ST_OVERRIDE_ENABLE_HELP                         #language en-US "Overrides the VccST voltage using SMBUS/PMBUS interface of VRM. Use the next option for exact voltage configuration"
#string STR_VCC_ST_OVERRIDE_VOLTS                               #language en-US "  VccST"
                                                                #language x-AMI "RCOC01X"
#string STR_VCC_ST_OVERRIDE_VOLTS_HELP                          #language en-US "Range of VccST voltage - 250 mV to 1500 mV. Default is 1020 mV"

#string STR_VCC_SA_OVERRIDE_ENABLE                              #language en-US "VccSA Override Enable"
                                                                #language x-AMI "RCOC01Z"
#string STR_VCC_SA_OVERRIDE_ENABLE_HELP                         #language en-US "Overrides the VccSA voltage using SMBUS/PMBUS interface of VRM. Use the next option for exact voltage configuration"
#string STR_VCC_SA_OVERRIDE_VOLTS                               #language en-US "  VccSA"
                                                                #language x-AMI "RCOC020"
#string STR_VCC_SA_OVERRIDE_VOLTS_HELP                          #language en-US "Range of VccSA voltage - Up to 1500 mV. Default is 1050 mV"

#string STR_VCC_SFR_OC_OVERRIDE_ENABLE                          #language en-US "VccSFR_OC Override Enable"
                                                                #language x-AMI "RCOC021"
#string STR_VCC_SFR_OC_OVERRIDE_ENABLE_HELP                     #language en-US "Overrides the VccSFR_OC voltage using SMBUS/PMBUS interface of VRM. Use the next option for exact voltage configuration"
#string STR_VCC_SFR_OC_OVERRIDE_VOLTS                           #language en-US "  VccSFR_OC"
                                                                #language x-AMI "RCOC022"
#string STR_VCC_SFR_OC_OVERRIDE_VOLTS_HELP                      #language en-US "Range of VccSFR_OC voltage range - 1000mV to 2520mV. Default is 1250mV"

#string STR_VCC_SFR_OVERRIDE_ENABLE                             #language en-US "VccSFR Override Enable"
                                                                #language x-AMI "RCOC024"
#string STR_VCC_SFR_OVERRIDE_ENABLE_HELP                        #language en-US "Overrides the VccSFR voltage using SMBUS/PMBUS interface of VRM. Use the next option for exact voltage configuration"
#string STR_VCC_SFR_OVERRIDE_VOLTS                              #language en-US "  VccSFR"
                                                                #language x-AMI "RCOC025"
#string STR_VCC_SFR_OVERRIDE_VOLTS_HELP                         #language en-US "Range of VccSFR voltage - 690mV to 2050mV. Default is 1020mV"

#string STR_VCC_IO_OVERRIDE_ENABLE                              #language en-US "VccIO Override Enable"
                                                                #language x-AMI "RCOC027"
#string STR_VCC_IO_OVERRIDE_ENABLE_HELP                         #language en-US "Overrides the VccIO voltage using SMBUS/PMBUS interface of VRM. Use the next option for exact voltage configuration"
#string STR_VCC_IO_OVERRIDE_VOLTS                               #language en-US "  VccIO"
                                                                #language x-AMI "RCOC028"
#string STR_VCC_IO_OVERRIDE_VOLTS_HELP                          #language en-US "Range of VccIO voltage - 900 mV to 1520 mV. Default is 950 mV"

#string STR_CORE_VR_DC_LL_OVERRIDE_ENABLE                       #language en-US "Core VR Loadline Override"
                                                                #language x-AMI "RCOC02S"
#string STR_CORE_VR_DC_LL_OVERRIDE_ENABLE_HELP                  #language en-US "Overrides the Core VR DC Loadline. Use the next option for exact voltage configuration"
#string STR_CORE_VR_DC_LOADLINE                                 #language en-US "  DC Loadline value"
                                                                #language x-AMI "RCOC02T"
#string STR_CORE_VR_DC_LOADLINE_HELP                            #language en-US "DC Loadline value as 2100 then override matches to 0xC produces the same value as without override (2.1mOhm)."

#string STR_VRLL_MINUS_100UOHM                                  #language en-US " -100 uOhm"
#string STR_VRLL_0UOHM                                          #language en-US "    0 uOhm"
#string STR_VRLL_100UOHM                                        #language en-US "  100 uOhm"
#string STR_VRLL_700UOHM                                        #language en-US "  700 uOhm"
#string STR_VRLL_900UOHM                                        #language en-US "  900 uOhm"
#string STR_VRLL_1000UOHM                                       #language en-US " 1000 uOhm"
#string STR_VRLL_1200UOHM                                       #language en-US " 1200 uOhm"
#string STR_VRLL_1300UOHM                                       #language en-US " 1300 uOhm"
#string STR_VRLL_1400UOHM                                       #language en-US " 1400 uOhm"
#string STR_VRLL_1500UOHM                                       #language en-US " 1500 uOhm"
#string STR_VRLL_1700UOHM                                       #language en-US " 1700 uOhm"
#string STR_VRLL_1800UOHM                                       #language en-US " 1800 uOhm"
#string STR_VRLL_2100UOHM                                       #language en-US " 2100 uOhm"


#string STR_MEMORY_CONFIGURATION                                #language en-US "Memory"
                                                                #language x-AMI "RCOC00B"
#string STR_MEMORY_CONFIGURATION_HELP                           #language en-US "Memory Overclocking Menu"

#string STR_IMON_SCALING                                        #language en-US "IMON Scaling Support"
                                                                #language x-AMI "RCOC005"
#string STR_IMON_SCALING_HELP                                   #language en-US "Support to Enable IMON Scaling"

#string STR_VBOOST_ENABLE_PROMPT                                #language en-US "Vboost Enable"
                                                                #language x-AMI "RCOC006"
#string STR_VBOOST_ENABLE_HELP                                  #language en-US "Enable/Disable Vboost circuit on RVP8 platforms only. Enabling will set GPIO F23 high and result in up to 300mV of extra voltage."

#string STR_RSR_ENABLE_PROMPT                                   #language en-US "RSR"
                                                                #language x-AMI "RCOC007"
#string STR_RSR_ENABLE_PROMPT_HELP                              #language en-US "Disable or Enable RSR feature." 

#string STR_MEMORY_VOLTAGE_VALUE                                #language en-US "Memory Voltage"
                                                                #language x-AMI "RCOC01H"
#string STR_MEMORY_VOLTAGE_VALUE_HELP                           #language en-US "Memory Voltage Override (Vddq). Default = no override"

#string STR_VOLTAGE_1100                                        #language en-US "1.10 Volts"
#string STR_VOLTAGE_1150                                        #language en-US "1.15 Volts"
#string STR_VOLTAGE_1200                                        #language en-US "1.20 Volts"
#string STR_VOLTAGE_1250                                        #language en-US "1.25 Volts"
#string STR_VOLTAGE_1300                                        #language en-US "1.30 Volts"
#string STR_VOLTAGE_1350                                        #language en-US "1.35 Volts"
#string STR_VOLTAGE_1400                                        #language en-US "1.40 Volts"
#string STR_VOLTAGE_1450                                        #language en-US "1.45 Volts"
#string STR_VOLTAGE_1500                                        #language en-US "1.50 Volts"
#string STR_VOLTAGE_1550                                        #language en-US "1.55 Volts"
#string STR_VOLTAGE_1600                                        #language en-US "1.60 Volts"
#string STR_VOLTAGE_1650                                        #language en-US "1.65 Volts"

#string STR_2                                                   #language en-US "2"
#string STR_3                                                   #language en-US "3"
#string STR_4                                                   #language en-US "4"
#string STR_5                                                   #language en-US "5"
#string STR_6                                                   #language en-US "6"
#string STR_7                                                   #language en-US "7"
#string STR_8                                                   #language en-US "8"
#string STR_9                                                   #language en-US "9"
#string STR_10                                                  #language en-US "10"
#string STR_11                                                  #language en-US "11"
#string STR_12                                                  #language en-US "12"
#string STR_13                                                  #language en-US "13"
#string STR_14                                                  #language en-US "14"
#string STR_15                                                  #language en-US "15"
#string STR_16                                                  #language en-US "16"
#string STR_17                                                  #language en-US "17"
#string STR_18                                                  #language en-US "18"
#string STR_19                                                  #language en-US "19"
#string STR_20                                                  #language en-US "20"
#string STR_21                                                  #language en-US "21"
#string STR_22                                                  #language en-US "22"
#string STR_23                                                  #language en-US "23"
#string STR_24                                                  #language en-US "24"
#string STR_25                                                  #language en-US "25"
#string STR_26                                                  #language en-US "26"
#string STR_27                                                  #language en-US "27"
#string STR_28                                                  #language en-US "28"
#string STR_29                                                  #language en-US "29"
#string STR_30                                                  #language en-US "30"
#string STR_31                                                  #language en-US "31"
#string STR_32                                                  #language en-US "32"
#string STR_40                                                  #language en-US "40"
#string STR_48                                                  #language en-US "48"
#string STR_56                                                  #language en-US "56"
#string STR_64                                                  #language en-US "64"
#string STR_80                                                  #language en-US "80"
#string STR_96                                                  #language en-US "96"
#string STR_112                                                 #language en-US "112"
#string STR_128                                                 #language en-US "128"

#string STR_DDR_REFCLK_PROMPT                                   #language en-US "Memory Reference Clock"
                                                                #language x-AMI "RCOC012"
#string STR_DDR_REFCLK_PROMPT_HELP                              #language en-US "Automatic, 100MHz, 133MHz."
#string STR_DDR_REFCLK_100_STRING                               #language en-US "100"
#string STR_DDR_REFCLK_133_STRING                               #language en-US "133"

#string STR_DDR_RATIO_PROMPT                                    #language en-US "Memory Ratio"
                                                                #language x-AMI "RCOC013"
#string STR_DDR_RATIO_PROMPT_HELP                               #language en-US "Automatic or the frequency will equal ratio times reference clock. Set to Auto to recalculate memory timings listed below."

#string STR_DDR_ODD_RATIO_MODE_PROMPT                           #language en-US "QCLK Odd Ratio"
                                                                #language x-AMI "RCOC014"
#string STR_DDR_ODD_RATIO_MODE_HELP                             #language en-US "Adds 133 or 100 MHz to QCLK frequency, depending on RefClk"

#string STR_MEMORY_VDD_NAME                                     #language en-US "VDD"
#string STR_MEMORY_VDD_VALUE                                    #language en-US "N/A"

#string STR_REALTIME_MEMORY_TIMING_PROMPT                       #language en-US "Realtime Memory Timing"
                                                                #language x-AMI "RCOC01O"
#string STR_REALTIME_MEMORY_TIMING_HELP                         #language en-US "Enable/Disable realtime memory timings. When enabled, the system will allow performing realtime memory timing changes after MRC_DONE."

#string STR_XMP_PROFILE_PROMPT                                  #language en-US "Memory profile"
                                                                #language x-AMI "RCOC011"
#string STR_XMP_PROFILE_PROMPT_HELP                             #language en-US "Select DIMM timing profile. The below values start with the currently running values and don't auto populate."

#string STR_DEFAULT_SPD_PROFILE                                 #language en-US "Default profile"
#string STR_XMP_PROFILE_1                                       #language en-US "XMP profile 1"
#string STR_XMP_PROFILE_2                                       #language en-US "XMP profile 2"
#string STR_CUSTOM_PROFILE                                      #language en-US "Custom profile"

#string STR_TCL_VALUE                                           #language en-US "  tCL"
                                                                #language x-AMI "RCOC015"
#string STR_TCL_VALUE_HELP                                      #language en-US "CAS Latency, 0: AUTO, max: 31"

#string STR_TRCD_TRP_VALUE                                      #language en-US "  tRCD/tRP"
                                                                #language x-AMI "RCOC016"
#string STR_TRCD_TRP_VALUE_HELP                                 #language en-US "RAS to CAS delay time and Row Precharge delay time, 0: AUTO, max: 63"

#string STR_TRAS_VALUE                                          #language en-US "  tRAS"
                                                                #language x-AMI "RCOC017"
#string STR_TRAS_VALUE_HELP                                     #language en-US "RAS Active Time, 0: AUTO, max: 64"

#string STR_TCWL_VALUE                                          #language en-US "  tCWL"
                                                                #language x-AMI "RCOC018"
#string STR_TCWL_VALUE_HELP                                     #language en-US "Min CAS Write Latency Delay Time, 0: AUTO, max: 20"

#string STR_TFAW_VALUE                                          #language en-US "  tFAW"
                                                                #language x-AMI "RCOC019"
#string STR_TFAW_VALUE_HELP                                     #language en-US "Min Four Activate Window Delay Time, 0: AUTO, max: 63"

#string STR_TREFI_VALUE                                         #language en-US "  tREFI"
                                                                #language x-AMI "RCOC01A"
#string STR_TREFI_VALUE_HELP                                    #language en-US "Refresh Interval, 0: AUTO, max: 65535"

#string STR_TRFC_VALUE                                          #language en-US "  tRFC"
                                                                #language x-AMI "RCOC01B"
#string STR_TRFC_VALUE_HELP                                     #language en-US "Min Refresh Recovery Delay Time, 0: AUTO, max: 1023"

#string STR_TRRD_VALUE                                          #language en-US "  tRRD"
                                                                #language x-AMI "RCOC01C"
#string STR_TRRD_VALUE_HELP                                     #language en-US "Min Row Active to Row Active Delay Time, 0: AUTO, max: 31"

#string STR_TRRD_L_VALUE                                        #language en-US "  tRRD_L"
                                                                #language x-AMI "RCOC02V"
#string STR_TRRD_L_VALUE_HELP                                   #language en-US "Min Row Active to Row Active Delay Time for Same Bank Group, 0: AUTO, max: 31"

#string STR_TRRD_S_VALUE                                        #language en-US "  tRRD_S"
                                                                #language x-AMI "RCOC02W"
#string STR_TRRD_S_VALUE_HELP                                   #language en-US "Min Row Active to Row Active Delay Time for Different Bank Group, 0: AUTO, max: 31"

#string STR_TRTP_VALUE                                          #language en-US "  tRTP"
                                                                #language x-AMI "RCOC01D"
#string STR_TRTP_VALUE_HELP                                     #language en-US "Min Internal Read to Precharge Command Delay Time. Shall be set to half of tWR value, 0: AUTO, max: 15. DDR4 legal values: 5, 6, 7, 8, 9, 10, 12"

#string STR_TWR_VALUE                                           #language en-US "  tWR"
                                                                #language x-AMI "RCOC01E"
#string STR_TWR_VALUE_HELP                                      #language en-US "Min Write Recovery Time, 0: AUTO, legal values: 5, 6, 7, 8, 10, 12, 14, 16, 18, 20, 24"

#string STR_TWTR_VALUE                                          #language en-US "  tWTR"
                                                                #language x-AMI "RCOC01F"
#string STR_TWTR_VALUE_HELP                                     #language en-US "Min Internal Write to Read Command Delay Time, 0: AUTO, max: 28"

#string STR_TWTR_L_VALUE                                        #language en-US "  tWTR_L"
                                                                #language x-AMI "RCOC02X"
#string STR_TWTR_L_VALUE_HELP                                   #language en-US "Min Internal Write to Read Command Delay Time for Same Bank Group, 0: AUTO, max: 60"

#string STR_TWTR_S_VALUE                                        #language en-US "  tWTR_S"
                                                                #language x-AMI "RCOC02Y"
#string STR_TWTR_S_VALUE_HELP                                   #language en-US "Min Internal Write to Read Command Delay Time for Different Bank Group, 0: AUTO, max: 28"

#string STR_NMODE_SUPPORT_PROMPT                                #language en-US "NMode"
                                                                #language x-AMI "RCOC01G"
#string STR_NMODE_SUPPORT_HELP                                  #language en-US "System command rate, range 0-2, 0 means AUTO, 1 = 1N, 2 = 2N"

#string STR_CMDRATE_SUPPORT_PROMPT                              #language en-US "Command Rate Support"
                                                                #language x-AMI "RCOC02Z"
#string STR_CMDRATE_SUPPORT_HELP                                #language en-US "CMD Rate and Limit Support Option. NOTE: ONLY supported in 1N Mode"
#string STR_1_CMD                                               #language en-US "1 CMD"
#string STR_2_CMDS                                              #language en-US "2 CMDs"
#string STR_3_CMDS                                              #language en-US "3 CMDs"
#string STR_4_CMDS                                              #language en-US "4 CMDs"
#string STR_5_CMDS                                              #language en-US "5 CMDs"
#string STR_6_CMDS                                              #language en-US "6 CMDs"
#string STR_7_CMDS                                              #language en-US "7 CMDs"

#string STR_GT_CONFIGURATION                                    #language en-US "GT"
                                                                #language x-AMI "RCOC00C"
#string STR_GT_CONFIGURATION_HELP                               #language en-US "GT Ratio Override and Delta voltage programming"

#string STR_GTS_OC_FREQUENCY_PROMPT                             #language en-US "GT OverClocking Frequency"
                                                                #language x-AMI "RCOC00N"
#string STR_GTUS_OC_FREQUENCY_PROMPT                            #language en-US "GT OverClocking Frequency"
                                                                #language x-AMI "RCOC00T"
#string STR_GT_OC_FREQUENCY_HELP                                #language en-US "Overclocked RP0 Frequency (MLC Clk) in multiples of 50 MHz. Range 0-255."
#string STR_GT_SLICE_TITLE                                      #language en-US "GT Slice Domain"
#string STR_GT_UNSLICE_TITLE                                    #language en-US "GT Unslice Domain"

#string STR_GTS_VOLTAGE_MODE                                    #language en-US "  GT Voltage Mode"
                                                                #language x-AMI "RCOC00O"
#string STR_GTUS_VOLTAGE_MODE                                   #language en-US "  GT Voltage Mode"
                                                                #language x-AMI "RCOC00U"
#string STR_GT_VOLTAGE_MODE_HELP                                #language en-US "Selects between Adaptive and Override Voltage modes. In Override Mode the voltage selected will be applied over all operating frequencies. In Adaptive Mode the voltage is interpolated only in turbo mode. Uses Mailbox MSR 0x150, cmd 0x10, 0x11."

#string STR_GTS_VOLTAGE_OVERRIDE                                #language en-US "  GT Voltage Override"
                                                                #language x-AMI "RCOC00P"
#string STR_GTUS_VOLTAGE_OVERRIDE                               #language en-US "  GT Voltage Override"
                                                                #language x-AMI "RCOC00V"
#string STR_GT_VOLTAGE_OVERRIDE_HELP                            #language en-US "Specifies the Override Voltage applied to the GT domain. This voltage is specified in millivolts. Uses Mailbox MSR 0x150, cmd 0x11. Range 0-2000 mV"

#string STR_GTS_VOLTAGE_OFFSET                                  #language en-US "  GT Voltage Offset"
                                                                #language x-AMI "RCOC00R"
#string STR_GTUS_VOLTAGE_OFFSET                                 #language en-US "  GTU Voltage Offset"
                                                                #language x-AMI "RCOC00X"
#string STR_GT_VOLTAGE_OFFSET_HELP                              #language en-US "Specifies the Offset Voltage applied to the GT domain. This voltage is specified in millivolts. Uses Mailbox MSR 0x150, cmd 0x11. Range -1000 to 1000 mV"

#string STR_GTS_EXTRA_TURBO_VOLTAGE                             #language en-US "  GT Extra Turbo Voltage"
                                                                #language x-AMI "RCOC00Q"
#string STR_GTUS_EXTRA_TURBO_VOLTAGE                            #language en-US "  GT Extra Turbo Voltage"
                                                                #language x-AMI "RCOC00W"
#string STR_GT_EXTRA_TURBO_VOLTAGE_HELP                         #language en-US "Specifies the extra turbo voltage applied while GT is operating in turbo mode. Unit is in millivolts. Uses Mailbox MSR 0x150, cmd 0x11. Range 0-2000 mV"

#string STR_RING_TITLE                                          #language en-US "Ring Domain"
#string STR_RING_DOWN_BIN_PROMPT                                #language en-US "  Ring Down Bin"
                                                                #language x-AMI "RCOC01N"
#string STR_RING_DOWN_BIN_HELP                                  #language en-US "Enable/Disable Ring Downbin feature. Enabled - CPU will down bin the ring ratio, which means the requested max ring ratio may not be observed. Disable - CPU will not down bin the ring ratio and the requested ring ratio limit will be observed. Default is Enabled. Please use caution when disabling this feature as it may result in overvoltaging of the CPU. Uses OC mailbox command 0x19."

#string STR_CLR_MAX_OC_RATIO                                    #language en-US "  Ring Max Ratio"
                                                                #language x-AMI "RCOC00L"
#string STR_CLR_MAX_OC_RATIO_HELP                               #language en-US "This sets the maximum ratio for the RING Domain. Uses Mailbox MSR 0x150, cmd 0x11."

#string STR_CLR_MIN_OC_RATIO                                    #language en-US "  Ring Min Ratio"
                                                                #language x-AMI "RCOC00M"
#string STR_CLR_MIN_OC_RATIO_HELP                               #language en-US "This sets the minimum ratio for the RING Domain."

#string STR_UNCORE_CONFIGURATION                                #language en-US "Uncore"
                                                                #language x-AMI "RCOC00D"
#string STR_UNCORE_CONFIGURATION_TITLE                          #language en-US "Uncore"
#string STR_UNCORE_CONFIGURATION_SUBTITLE                       #language en-US "Uncore"
#string STR_UNCORE_CONFIGURATION_HELP                           #language en-US "Uncore Overclocking Menu"

#string STR_UNCORE_VOLTAGE_OFFSET                               #language en-US "Uncore Voltage Offset"
                                                                #language x-AMI "RCOC00Z"
#string STR_UNCORE_VOLTAGE_OFFSET_HELP                          #language en-US "Specifies the Offset Voltage applied to the Uncore domain. This voltage is specified in millivolts. Uses Mailbox MSR 0x150, cmd 0x11. Range -1000 to 1000 mV"

#string STR_PCODE_BCLK_FREQUENCY_NAME                           #language en-US "BCLK Frequency (pcode)"
#string STR_PCODE_BCLK_FREQUENCY_VALUE                          #language en-US "100.00 MHz"

#string STR_MEMORY_TIMING_HEADER_NAME                           #language en-US "Memory Profile:"
#string STR_MEMORY_TIMING_HEADER_VALUE                          #language en-US "Default  Custom    XMP1    XMP2"

#string STR_MEMORY_TIMING_TCK_NAME                              #language en-US "  tCK [MHz]"
#string STR_MEMORY_TIMING_TCK_VALUE                             #language en-US "0000000 0000000 0000000 0000000"

#string STR_MEMORY_TIMING_TCL_NAME                              #language en-US "  tCL"
#string STR_MEMORY_TIMING_TCL_VALUE                             #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TRCD_TRP_NAME                         #language en-US "  tRCD/tRP"
#string STR_MEMORY_TIMING_TRCD_TRP_VALUE                        #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TRP_NAME                              #language en-US "  tRP"
#string STR_MEMORY_TIMING_TRP_VALUE                             #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TRAS_NAME                             #language en-US "  tRAS"
#string STR_MEMORY_TIMING_TRAS_VALUE                            #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TCWL_NAME                             #language en-US "  tCWL"
#string STR_MEMORY_TIMING_TCWL_VALUE                            #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TFAW_NAME                             #language en-US "  tFAW"
#string STR_MEMORY_TIMING_TFAW_VALUE                            #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TREFI_NAME                            #language en-US "  tREFI"
#string STR_MEMORY_TIMING_TREFI_VALUE                           #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TRFC_NAME                             #language en-US "  tRFC"
#string STR_MEMORY_TIMING_TRFC_VALUE                            #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TRRD_NAME                             #language en-US "  tRRD"
#string STR_MEMORY_TIMING_TRRD_L_NAME                           #language en-US "  tRRD_L"
#string STR_MEMORY_TIMING_TRRD_VALUE                            #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TRRD_S_NAME                           #language en-US "  tRRD_S"
#string STR_MEMORY_TIMING_TRRD_S_VALUE                          #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TRTP_NAME                             #language en-US "  tRTP"
#string STR_MEMORY_TIMING_TRTP_VALUE                            #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TWR_NAME                              #language en-US "  tWR"
#string STR_MEMORY_TIMING_TWR_VALUE                             #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TWTR_NAME                             #language en-US "  tWTR"
#string STR_MEMORY_TIMING_TWTR_L_NAME                           #language en-US "  tWTR_L"
#string STR_MEMORY_TIMING_TWTR_VALUE                            #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_TWTR_S_NAME                           #language en-US "  tWTR_S"
#string STR_MEMORY_TIMING_TWTR_S_VALUE                          #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_TIMING_NMODE_NAME                            #language en-US "  NMode"
#string STR_MEMORY_TIMING_NMODE_VALUE                           #language en-US "  00000   00000   00000   00000"

#string STR_MEMORY_VOLTAGE_VDD_NAME                             #language en-US "  VDD [mV]"
#string STR_MEMORY_VOLTAGE_VDD_VALUE                            #language en-US "  00000   00000   00000   00000"

#string STR_DLLBWEN0_PROMPT                                     #language en-US "DllBwEn[0]"
                                                                #language x-AMI "RCOC01I"
#string STR_DLLBWEN0_HELP                                       #language en-US "DllBwEn[0], for 1067 (0..7)"

#string STR_DLLBWEN1_PROMPT                                     #language en-US "DllBwEn[1]"
                                                                #language x-AMI "RCOC01J"
#string STR_DLLBWEN1_HELP                                       #language en-US "DllBwEn[1], for 1333 (0..7)"

#string STR_DLLBWEN2_PROMPT                                     #language en-US "DllBwEn[2]"
                                                                #language x-AMI "RCOC01K"
#string STR_DLLBWEN2_HELP                                       #language en-US "DllBwEn[2], for 1600 (0..7)"

#string STR_DLLBWEN3_PROMPT                                     #language en-US "DllBwEn[3]"
                                                                #language x-AMI "RCOC01L"
#string STR_DLLBWEN3_HELP                                       #language en-US "DllBwEn[3], for 1867 and up (0..7)"

//Turn Around Timing
#string STR_TURNAROUNDTIMING_TITLE                              #language en-US "Turn Around Timing"
                                                                #language x-AMI "RCOC029"
#string STR_TURNAROUNDTIMING_HELP                               #language en-US "Knobs to override default timings.  0 is no override."

#string STR_TURNAROUNDTIMING_HEADER_NAME                        #language en-US "Current Turn Around Times"
#string STR_TURNAROUNDTIMING_HEADER_VALUE                       #language en-US "     SG      DG      DR      DD"
#string STR_CHANNEL_0                                           #language en-US "Channel 0"
#string STR_CHANNEL_1                                           #language en-US "Channel 1"

#string STR_TURNAROUNDTIMING_RD2RD_NAME                         #language en-US "  Read-to-Read  "
#string STR_TURNAROUNDTIMING_RD2RD_CH0_VALUE                    #language en-US "  00000   00000   00000   00000"
#string STR_TURNAROUNDTIMING_RD2RD_CH1_VALUE                    #language en-US "  00000   00000   00000   00000"

#string STR_TURNAROUNDTIMING_RD2WR_NAME                         #language en-US "  Read-to-Write "
#string STR_TURNAROUNDTIMING_RD2WR_CH0_VALUE                    #language en-US "  00000   00000   00000   00000"
#string STR_TURNAROUNDTIMING_RD2WR_CH1_VALUE                    #language en-US "  00000   00000   00000   00000"

#string STR_TURNAROUNDTIMING_WR2RD_NAME                         #language en-US "  Write-to-Read "
#string STR_TURNAROUNDTIMING_WR2RD_CH0_VALUE                    #language en-US "  00000   00000   00000   00000"
#string STR_TURNAROUNDTIMING_WR2RD_CH1_VALUE                    #language en-US "  00000   00000   00000   00000"

#string STR_TURNAROUNDTIMING_WR2WR_NAME                         #language en-US "  Write-to-Write"
#string STR_TURNAROUNDTIMING_WR2WR_CH0_VALUE                    #language en-US "  00000   00000   00000   00000"
#string STR_TURNAROUNDTIMING_WR2WR_CH1_VALUE                    #language en-US "  00000   00000   00000   00000"

//Read-to-Read
#string STR_TRRSG_VALUE                                         #language en-US "tRd2RdSG"
                                                            	#language x-AMI "RCOC02A"
#string STR_TRRSG_HELP                                          #language en-US "Delay between Read-to-Read commands in the same Bank Group. 0-Auto, Range 4-54."
#string STR_TRRDG_VALUE                                         #language en-US "tRd2RdDG"
                                                            	#language x-AMI "RCOC02B"
#string STR_TRRDG_HELP                                          #language en-US "Delay between Read-to-Read commands in different Bank Group for DDR4. All other DDR technologies should set this equal to SG. 0-Auto, Range 4-54."
#string STR_TRRDR_VALUE                                         #language en-US "tRd2RdDR"
                                                            	#language x-AMI "RCOC02C"
#string STR_TRRDR_HELP                                          #language en-US "Delay between Read-to-Read commands in different Ranks. 0-Auto, Range 4-54."
#string STR_TRRDD_VALUE                                         #language en-US "tRd2RdDD"
                                                            	#language x-AMI "RCOC02D"
#string STR_TRRDD_HELP                                          #language en-US "Delay between Read-to-Read commands in different DIMMs. 0-Auto, Range 4-54."

//Read-to-Write
#string STR_TRWSG_VALUE                                         #language en-US "tRd2WrSG"
                                                            	#language x-AMI "RCOC02E"
#string STR_TRWSG_HELP                                          #language en-US "Delay between Read-to-Write commands in the same Bank Group. 0-Auto, Range 4-54."
#string STR_TRWDG_VALUE                                         #language en-US "tRd2WrDG"
                                                            	#language x-AMI "RCOC02F"
#string STR_TRWDG_HELP                                          #language en-US "Delay between Read-to-Write commands in different Bank Group for DDR4. All other DDR technologies should set this equal to SG. 0-Auto, Range 4-54."
#string STR_TRWDR_VALUE                                         #language en-US "tRd2WrDR"
                                                            	#language x-AMI "RCOC02G"
#string STR_TRWDR_HELP                                          #language en-US "Delay between Read-to-Write commands in different Ranks. 0-Auto, Range 4-54."
#string STR_TRWDD_VALUE                                         #language en-US "tRd2WrDD"
                                                            	#language x-AMI "RCOC02H"
#string STR_TRWDD_HELP                                          #language en-US "Delay between Read-to-Write commands in different DIMMs. 0-Auto, Range 4-54."

//Write-to-Read
#string STR_TWRSG_VALUE                                         #language en-US "tWr2RdSG"
                                                            	#language x-AMI "RCOC02I"
#string STR_TWRSG_HELP                                          #language en-US "Delay between Write-to-Read commands in the same Bank Group. 0-Auto, Range 4-86."
#string STR_TWRDG_VALUE                                         #language en-US "tWr2RdDG"
                                                           	#language x-AMI "RCOC02J"
#string STR_TWRDG_HELP                                          #language en-US "Delay between Write-to-Read commands in different Bank Group for DDR4. All other DDR technologies should set this equal to SG. 0-Auto, Range 4-54."
#string STR_TWRDR_VALUE                                         #language en-US "tWr2RdDR"
                                                            	#language x-AMI "RCOC02K"
#string STR_TWRDR_HELP                                          #language en-US "Delay between Write-to-Read commands in different Ranks. 0-Auto, Range 4-54."
#string STR_TWRDD_VALUE                                         #language en-US "tWr2RdDD"
                                                            	#language x-AMI "RCOC02L"
#string STR_TWRDD_HELP                                          #language en-US "Delay between Write-to-Read commands in different DIMMs. 0-Auto, Range 4-54."

//Write-to-Write
#string STR_TWWSG_VALUE                                         #language en-US "tWr2WrSG"
                                                            	#language x-AMI "RCOC02M"
#string STR_TWWSG_HELP                                          #language en-US "Delay between Write-to-Write commands in the same Bank Group. 0-Auto, Range 4-54."
#string STR_TWWDG_VALUE                                         #language en-US "tWr2WrDG"
                                                            	#language x-AMI "RCOC02N"
#string STR_TWWDG_HELP                                          #language en-US "Delay between Write-to-Write commands in different Bank Group for DDR4. All other DDR technologies should set this equal to SG. 0-Auto, Range 4-54."
#string STR_TWWDR_VALUE                                         #language en-US "tWr2WrDR"
                                                            	#language x-AMI "RCOC02O"
#string STR_TWWDR_HELP                                          #language en-US "Delay between Write-to-Write commands in different Ranks. 0-Auto, Range 4-54."
#string STR_TWWDD_VALUE                                         #language en-US "tWr2WrDD"
                                                            	#language x-AMI "RCOC02P"
#string STR_TWWDD_HELP                                          #language en-US "Delay between Write-to-Write commands in different DIMMs. 0-Auto, Range 4-54."

// ***Don't modify this line, its automatically generated.?#02Y#!***